# Project 13 - Advanced Pandas Functions Tutorial

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

We are using a mock/dummy dataset

In [3]:
data = {'age' : [25, 22, 18, 30, 45, 50, 35, 20, 55, 40],
        'gender' : ['M', 'F', 'F', 'M', 'M', 'F', 'M', 'F', 'M', 'M'],
        'score' : [90, 80, 75, 95, 70, 85, 75, 90, 95, 85]}

df_dummy = pd.DataFrame(data)

## 1. value_counts()

In [4]:
df_dummy.columns

Index(['age', 'gender', 'score'], dtype='object')

In [5]:
df_dummy['gender'].value_counts()

gender
M    6
F    4
Name: count, dtype: int64

In [6]:
df_dummy['gender'].value_counts(normalize=True)

gender
M    0.6
F    0.4
Name: proportion, dtype: float64

## 2. where()

In [7]:
df_dummy.where(df_dummy['age'] > 30)

    age gender  score
0   NaN    NaN    NaN
1   NaN    NaN    NaN
2   NaN    NaN    NaN
3   NaN    NaN    NaN
4  45.0      M   70.0
5  50.0      F   85.0
6  35.0      M   75.0
7   NaN    NaN    NaN
8  55.0      M   95.0
9  40.0      M   85.0

In [7]:
df_dummy.where(df_dummy['age'] > 30, other=0)

   age gender  score
0    0      0      0
1    0      0      0
2    0      0      0
3    0      0      0
4   45      M     70
5   50      F     85
6   35      M     75
7    0      0      0
8   55      M     95
9   40      M     85

notice the difference with this line of code

In [8]:
df_dummy[df_dummy['age'] > 30]

   age gender  score
4   45      M     70
5   50      F     85
6   35      M     75
8   55      M     95
9   40      M     85

using `.where()` function along with `.all()` function, we can get the same result

In [9]:
df_dummy.where(df_dummy['age'] > 30, other=0).all(1)

0    False
1    False
2    False
3    False
4     True
5     True
6     True
7    False
8     True
9     True
dtype: bool

pass the statement inside `df_dummy`, and we get:

In [10]:
df_dummy[df_dummy.where(df_dummy['age'] > 30, other=0).all(1)]

   age gender  score
4   45      M     70
5   50      F     85
6   35      M     75
8   55      M     95
9   40      M     85

et voila.. we get exactly the same result with

` df_dummy[df_dummy['age'] > 30] `

### 2.1. Using multiple conditions

In [11]:
condition_1 = df_dummy['age'] > 30
condition_2 = df_dummy['gender'] == 'F'

In [12]:
df_dummy.where(condition_1 & condition_2)

    age gender  score
0   NaN    NaN    NaN
1   NaN    NaN    NaN
2   NaN    NaN    NaN
3   NaN    NaN    NaN
4   NaN    NaN    NaN
5  50.0      F   85.0
6   NaN    NaN    NaN
7   NaN    NaN    NaN
8   NaN    NaN    NaN
9   NaN    NaN    NaN

to subset the dataset, we can use the same method above

In [13]:
df_dummy[df_dummy.where(condition_1 & condition_2, other=0).all(1)]

   age gender  score
5   50      F     85

similarly, but much shorter

In [14]:
df_dummy[condition_1 & condition_2]

   age gender  score
5   50      F     85

## 3. isin()

In [15]:
df_dummy[df_dummy['age'].isin([25, 35])]

   age gender  score
0   25      M     90
6   35      M     75

we can filter our dataset using multiple conditions

In [16]:
df_dummy[df_dummy[['age', 'gender']].isin({'age': [25, 35], 'gender': ['M']}).all(1)]

   age gender  score
0   25      M     90
6   35      M     75

## 4. cut()

In [17]:
df_dummy

   age gender  score
0   25      M     90
1   22      F     80
2   18      F     75
3   30      M     95
4   45      M     70
5   50      F     85
6   35      M     75
7   20      F     90
8   55      M     95
9   40      M     85

In [18]:
df_dummy['score bins'] = pd.cut(df_dummy['score'], bins=[60, 70, 80, 85, 90, 100])

In [19]:
df_dummy

   age gender  score score bins
0   25      M     90   (85, 90]
1   22      F     80   (70, 80]
2   18      F     75   (70, 80]
3   30      M     95  (90, 100]
4   45      M     70   (60, 70]
5   50      F     85   (80, 85]
6   35      M     75   (70, 80]
7   20      F     90   (85, 90]
8   55      M     95  (90, 100]
9   40      M     85   (80, 85]

using bins as categories/labels

In [20]:
bin_labels = ['Very low', 'Low', 'Medium', 'High', 'Very high']

df_dummy['score bins'] = pd.cut(df_dummy['score'], bins=[60, 70, 80, 85, 90, 100], labels=bin_labels)

In [21]:
df_dummy

   age gender  score score bins
0   25      M     90       High
1   22      F     80        Low
2   18      F     75        Low
3   30      M     95  Very high
4   45      M     70   Very low
5   50      F     85     Medium
6   35      M     75        Low
7   20      F     90       High
8   55      M     95  Very high
9   40      M     85     Medium

## 5. qcut()

In [22]:
age_bins = pd.qcut(df_dummy['age'], 4)

In [23]:
age_bins

0      (22.75, 32.5]
1    (17.999, 22.75]
2    (17.999, 22.75]
3      (22.75, 32.5]
4      (43.75, 55.0]
5      (43.75, 55.0]
6      (32.5, 43.75]
7    (17.999, 22.75]
8      (43.75, 55.0]
9      (32.5, 43.75]
Name: age, dtype: category
Categories (4, interval[float64, right]): [(17.999, 22.75] < (22.75, 32.5] < (32.5, 43.75] < (43.75, 55.0]]

Using labels

In [24]:
df_dummy['age_bins'] = pd.qcut(df_dummy['age'], 4, labels=['Young', 'Mid-young', 'Mid-adult', 'Senior'])

In [25]:
df_dummy

   age gender  score score bins   age_bins
0   25      M     90       High  Mid-young
1   22      F     80        Low      Young
2   18      F     75        Low      Young
3   30      M     95  Very high  Mid-young
4   45      M     70   Very low     Senior
5   50      F     85     Medium     Senior
6   35      M     75        Low  Mid-adult
7   20      F     90       High      Young
8   55      M     95  Very high     Senior
9   40      M     85     Medium  Mid-adult

## 6. groupby()

In [26]:
df_dummy

   age gender  score score bins   age_bins
0   25      M     90       High  Mid-young
1   22      F     80        Low      Young
2   18      F     75        Low      Young
3   30      M     95  Very high  Mid-young
4   45      M     70   Very low     Senior
5   50      F     85     Medium     Senior
6   35      M     75        Low  Mid-adult
7   20      F     90       High      Young
8   55      M     95  Very high     Senior
9   40      M     85     Medium  Mid-adult

first, we group the data by gender

In [28]:
gender_grouped = df_dummy.groupby('gender')

Let's say we want to calculate the score mean by gender

In [29]:
gender_grouped['score'].mean()

gender
F    82.5
M    85.0
Name: score, dtype: float64

In [30]:
# similarly, one liner equivalent to the method above is
df_dummy.groupby('gender')['score'].mean()

gender
F    82.5
M    85.0
Name: score, dtype: float64

Grouping and aggregating using multiple functions

In [31]:
gender_grouped['score'].agg(['mean', 'sum', 'count'])

        mean  sum  count
gender
F       82.5  330      4
M       85.0  510      6

In [32]:
df_dummy.groupby('gender').agg({'age': 'max', 'score':'mean'})

        age  score
gender
F        50   82.5
M        55   85.0

## 7. pivot_table()

In [33]:
df_dummy.pivot_table(index='gender',
                     values='score',
                     aggfunc='mean')

        score
gender
F        82.5
M        85.0

With multiple indices

In [34]:
df_dummy.pivot_table(index=['gender', 'age'],
                     values='score',
                     aggfunc='mean')

            score
gender age
F      18      75
       20      90
       22      80
       50      85
M      25      90
       30      95
       35      75
       40      85
       45      70
       55      95

With multiple values

In [35]:
df_dummy.pivot_table(index='gender',
                     values=['age', 'score'],
                     aggfunc='mean')

              age  score
gender
F       27.500000   82.5
M       38.333333   85.0

With multiple aggregation functions

In [36]:
df_dummy.pivot_table(index=['gender'],
                     values=['age', 'score'],
                     aggfunc=['sum', 'mean', 'count'])

        sum             mean       count
        age score        age score   age score
gender
F       110   330  27.500000  82.5     4     4
M       230   510  38.333333  85.0     6     6

## 8. nlargest() and nsmallest()

### 8.1. nlargest()

In [37]:
df_dummy['score'].nlargest(3)

3    95
8    95
0    90
Name: score, dtype: int64

Similar, but longer and quite impractical

In [38]:
df_dummy['score'].sort_values(ascending=False).head(3)

3    95
8    95
0    90
Name: score, dtype: int64

Useful method

In [39]:
df_dummy.nlargest(3, 'score')

   age gender  score score bins   age_bins
3   30      M     95  Very high  Mid-young
8   55      M     95  Very high     Senior
0   25      M     90       High  Mid-young

Similar result

In [40]:
df_dummy.sort_values(by='score', ascending=False).head(3)

   age gender  score score bins   age_bins
3   30      M     95  Very high  Mid-young
8   55      M     95  Very high     Senior
0   25      M     90       High  Mid-young

### 8.2. nsmallest()

In [41]:
df_dummy['score'].nsmallest(3)

4    70
2    75
6    75
Name: score, dtype: int64

In [42]:
df_dummy.nsmallest(3, 'score')

   age gender  score score bins   age_bins
4   45      M     70   Very low     Senior
2   18      F     75        Low      Young
6   35      M     75        Low  Mid-adult

## 9. query()

Notice the `query()` function takes string as an argument

In [43]:
df_dummy.query('age > 25')

   age gender  score score bins   age_bins
3   30      M     95  Very high  Mid-young
4   45      M     70   Very low     Senior
5   50      F     85     Medium     Senior
6   35      M     75        Low  Mid-adult
8   55      M     95  Very high     Senior
9   40      M     85     Medium  Mid-adult

Multiple conditions

In [44]:
df_dummy.query("age > 25 and gender == 'F'")

   age gender  score score bins age_bins
5   50      F     85     Medium   Senior

This function is useful when we want to chain longer conditions together

## 10. sort_values()

In [45]:
df_dummy.head()

   age gender  score score bins   age_bins
0   25      M     90       High  Mid-young
1   22      F     80        Low      Young
2   18      F     75        Low      Young
3   30      M     95  Very high  Mid-young
4   45      M     70   Very low     Senior

In [46]:
df_dummy.sort_values(by='age', ascending=False)

   age gender  score score bins   age_bins
8   55      M     95  Very high     Senior
5   50      F     85     Medium     Senior
4   45      M     70   Very low     Senior
9   40      M     85     Medium  Mid-adult
6   35      M     75        Low  Mid-adult
3   30      M     95  Very high  Mid-young
0   25      M     90       High  Mid-young
1   22      F     80        Low      Young
7   20      F     90       High      Young
2   18      F     75        Low      Young

## 11. apply()

In [47]:
df_dummy.head()

   age gender  score score bins   age_bins
0   25      M     90       High  Mid-young
1   22      F     80        Low      Young
2   18      F     75        Low      Young
3   30      M     95  Very high  Mid-young
4   45      M     70   Very low     Senior

Let's say we want to lowercase the gender column

In [48]:
df_dummy['gender_lower'] = df_dummy['gender'].apply(str.lower)

In [49]:
df_dummy

   age gender  score score bins   age_bins gender_lower
0   25      M     90       High  Mid-young            m
1   22      F     80        Low      Young            f
2   18      F     75        Low      Young            f
3   30      M     95  Very high  Mid-young            m
4   45      M     70   Very low     Senior            m
5   50      F     85     Medium     Senior            f
6   35      M     75        Low  Mid-adult            m
7   20      F     90       High      Young            f
8   55      M     95  Very high     Senior            m
9   40      M     85     Medium  Mid-adult            m

Using `lambda` function to square the age

In [50]:
df_dummy['age_squared'] = df_dummy['age'].apply(lambda x: x ** 2)

In [51]:
df_dummy

   age gender  score score bins   age_bins gender_lower  age_squared
0   25      M     90       High  Mid-young            m          625
1   22      F     80        Low      Young            f          484
2   18      F     75        Low      Young            f          324
3   30      M     95  Very high  Mid-young            m          900
4   45      M     70   Very low     Senior            m         2025
5   50      F     85     Medium     Senior            f         2500
6   35      M     75        Low  Mid-adult            m         1225
7   20      F     90       High      Young            f          400
8   55      M     95  Very high     Senior            m         3025
9   40      M     85     Medium  Mid-adult            m         1600

Using custom defined function

In [52]:
# create a function that returns a divided value of each input
def div_age(x):
    return x // 2

In [53]:
df_dummy['age_div_two'] = df_dummy['age'].apply(div_age)

In [54]:
df_dummy

,age,gender,score,score bins,age_bins,gender_lower,age_squared,age_div_two
0,25,M,90,High,Mid-young,m,625,12
1,22,F,80,Low,Young,f,484,11
2,18,F,75,Low,Young,f,324,9
3,30,M,95,Very high,Mid-young,m,900,15
4,45,M,70,Very low,Senior,m,2025,22
5,50,F,85,Medium,Senior,f,2500,25
6,35,M,75,Low,Mid-adult,m,1225,17
7,20,F,90,High,Young,f,400,10
8,55,M,95,Very high,Senior,m,3025,27
9,40,M,85,Medium,Mid-adult,m,1600,20

## 12. rename()

Rename a column name

In [55]:
df_dummy = df_dummy.rename(columns={'score bins' : 'score_bins'})

In [56]:
df_dummy

,age,gender,score,score_bins,age_bins,gender_lower,age_squared,age_div_two
0,25,M,90,High,Mid-young,m,625,12
1,22,F,80,Low,Young,f,484,11
2,18,F,75,Low,Young,f,324,9
3,30,M,95,Very high,Mid-young,m,900,15
4,45,M,70,Very low,Senior,m,2025,22
5,50,F,85,Medium,Senior,f,2500,25
6,35,M,75,Low,Mid-adult,m,1225,17
7,20,F,90,High,Young,f,400,10
8,55,M,95,Very high,Senior,m,3025,27
9,40,M,85,Medium,Mid-adult,m,1600,20